[{
	"day": 1.0
	, "arabic": "هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ لَمْ يَكُن شَيْئًا مَّذْكُورًا"
	, "english": "Has there not been over man a period of time when he was nothing to be mentioned?"
	, "source": "The Quran 76:01 (Surah al-Insan)"
}, {
	"day": 2.0
	, "arabic": "الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا ۖ وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا"
	, "english": "Wealth and children are but adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for one’s hope."
	, "source": "The Quran 18:46 (Surah al-Kahf)"
}, {
	"day": 3.0
	, "arabic": "وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّـهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ"
	, "english": "And fear the Day when you shall be brought back to Allah. Then every soul shall be paid what it earned, and none shall be dealt with unjustly."
	, "source": "The Quran 02:281 (Surah al-Baqarah)"
}, {
	"day": 4.0
	, "arabic": "وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ ۚ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا"
	, "english": "Truth has come and falsehood has vanished. Indeed! Falsehood is ever bound to vanish."
	, "source": "The Quran 17:81 (Surah al-Isra)"
}, {
	"day": 5.0
	, "arabic": "أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا ۚ وَإِنَّ اللَّـهَ عَلَىٰ نَصْرِهِمْ لَقَدِيرٌ"
	, "english": "The ones who are (forced to) fight are permitted (to defend themselves) for that they are unjustly (attacked); and surely Allah is indeed Ever-Determiner over giving them victory."
	, "source": "The Quran 22:39 (Surah al-Haj)"
}, {
	"day": 6.0
	, "arabic": "وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا لِّتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ"
	, "english": "And of His Signs is that He created for you mates from among yourselves that you may find tranquillity in them; and He placed between you affection and mercy. Indeed, in that are Signs for those who reflect."
	, "source": "The Quran 30:21 (Surah ar-Rum)"
}, {
	"day": 7.0
	, "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّـهَ وَذَرُوا مَا بَقِيَ مِنَ الرِّبَا إِن كُنتُم مُّؤْمِنِينَ "
	, "english": "O ye who believe! Observe your duty to Allah, and give up what remaineth (due to you) from usury, if you are (in truth) believers."
	, "source": "The Quran 02:278 (Surah al-Baqarah)"
}, {
	"day": 8.0
	, "arabic": "لَا يُكَلِّفُ اللَّـهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"
	, "english": "Allah does not burden a soul beyond its capacity. It gets the consequence of what good it has earned, and it bears the consequence of what evil it has earned. \"Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our Protector, so give us victory over the wrong-doing people.\""
	, "source": "The Quran 02:286 (Surah al-Baqarah)"
}, {
	"day": 9.0
	, "arabic": "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ ۚ وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ"
	, "english": "He merges night into day, and He merges day into night; and He has full Knowledge of the secrets of all hearts."
	, "source": "The Quran 57:06 (Surah al-Hadid)"
}, {
	"day": 10.0
	, "arabic": "هُوَ الَّذِي جَعَلَ الشَّمْسَ ضِيَاءً وَالْقَمَرَ نُورًا وَقَدَّرَهُ مَنَازِلَ لِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ ۚ مَا خَلَقَ اللَّـهُ ذَٰلِكَ إِلَّا بِالْحَقِّ ۚ يُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ "
	, "english": "It is He Who made the sun a shining light and the moon a derived light and determined for it phases — that you may know the number of years and account (of time). Allah has not created this except in truth. He details the signs for those with knowledge."
	, "source": "The Quran 10:05 (Surah Yunus)"
}, {
	"day": 11.0
	, "arabic": "كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ  وَنَبْلُوكُم بِالشَّرِّ وَالْخَيْرِ فِتْنَةً  وَإِلَيْنَا تُرْجَعُونَ"
	, "english": "Every soul will taste death. And We test you with evil and with good as trial. And to Us you will be returned."
	, "source": "The Quran 21:35 (Surah al-Anbiya)"
}, {
	"day": 12.0
	, "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِن جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَن تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ"
	, "english": "O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful."
	, "source": "The Quran 49:06 (Surah al-Hujurat)"
}, {
	"day": 13.0
	, "arabic": "وَلَا تَسُبُّوا الَّذِينَ يَدْعُونَ مِن دُونِ اللَّـهِ فَيَسُبُّوا اللَّـهَ عَدْوًا بِغَيْرِ عِلْمٍ  كَذَٰلِكَ زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ ثُمَّ إِلَىٰ رَبِّهِم مَّرْجِعُهُمْ فَيُنَبِّئُهُم بِمَا كَانُوا يَعْمَلُونَ"
	, "english": "And do not insult those they invoke other than Allah, lest they insult Allah in enmity without knowledge. Thus We have made pleasing to every community their deeds. Then to their Lord is their return, and He will inform them about what they used to do."
	, "source": "The Quran 06:108 (Surah al-An’am)"
}, {
	"day": 14.0
	, "arabic": "يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ  قُلْ فِيهِمَا إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ وَإِثْمُهُمَا أَكْبَرُ مِن نَّفْعِهِمَا  وَيَسْأَلُونَكَ مَاذَا يُنفِقُونَ قُلِ الْعَفْوَ  كَذَٰلِكَ يُبَيِّنُ اللَّـهُ لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَتَفَكَّرُونَ"
	, "english": "They ask you about wine and gambling. Say, \"In them is great sin and [yet, some] benefit for people. But their sin is greater than their benefit.\" And they ask you what they should spend. Say, \"The excess [beyond needs].\" Thus Allah makes clear to you the verses [of revelation] that you might give thought."
	, "source": "The Quran 02:219 (Surah al-Baqarah)"
}, {
	"day": 15.0
	, "arabic": "فَإِن لَّمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ  وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِّنَ اللَّـهِ  إِنَّ اللَّـهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ"
	, "english": "But if they do not respond to you - then know that they only follow their [own] desires. And who is more astray than one who follows his desire without guidance from Allah? Indeed, Allah does not guide the wrongdoing people."
	, "source": "The Quran 28:50 (Surah al-Qasas)"
}, {
	"day": 16.0
	, "arabic": "وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ  لَا تَسْجُدُوا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوا لِلَّـهِ الَّذِي خَلَقَهُنَّ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ"
	, "english": "And of His signs are the night and day and the sun and moon. Do not prostrate to the sun or to the moon, but prostate to Allah, who created them, if it should be Him that you worship."
	, "source": "The Quran 41:37 (Surah al-Fussilat)"
}, {
	"day": 17.0
	, "arabic": "مِنْهَا خَلَقْنَاكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَىٰ"
	, "english": "From the earth We created you, and into it We will return you, and from it We will extract you another time. "
	, "source": "The Quran 20:55 (Surah Ta-Ha)"
}, {
	"day": 18.0
	, "arabic": "وَآتِ ذَا الْقُرْبَىٰ حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ وَلَا تُبَذِّرْ تَبْذِيرًا"
	, "english": "And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully."
	, "source": "The Quran 17:26 (Surah al-Isra)"
}, {
	"day": 19.0
	, "arabic": "وَهُوَ الَّذِي يُحْيِي وَيُمِيتُ وَلَهُ اخْتِلَافُ اللَّيْلِ وَالنَّهَارِ  أَفَلَا تَعْقِلُونَ"
	, "english": "And it is He who gives life and causes death, and His is the alternation of the night and the day. Then will you not reason?"
	, "source": "The Quran 23:80 (Surah al-Mu’minun)"
}, {
	"day": 20.0
	, "arabic": "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ"
	, "english": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?"
	, "source": "The Quran 54:17 (Surah al-Qamar)"
}, {
	"day": 21.0
	, "arabic": "إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ ۚ وَإِن تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ"
	, "english": "[This] worldly life is only amusement and diversion. And if you believe and fear Allah, He will give you your rewards and not ask you for your properties."
	, "source": "The Quran 47:36 (Surah Muhammad)"
}, {
	"day": 22.0
	, "arabic": "وَابْتَغِ فِيمَا آتَاكَ اللَّـهُ الدَّارَ الْآخِرَةَ ۖ وَلَا تَنسَ نَصِيبَكَ مِنَ الدُّنْيَا ۖ وَأَحْسِن كَمَا أَحْسَنَ اللَّـهُ إِلَيْكَ ۖ وَلَا تَبْغِ الْفَسَادَ فِي الْأَرْضِ ۖ إِنَّ اللَّـهَ لَا يُحِبُّ الْمُفْسِدِينَ"
	, "english": "But seek, through that which Allah has given you, the home of the Hereafter; and [yet], do not forget your share of the world. And do good as Allah has done good to you. And desire not corruption in the land. Indeed, Allah does not like corrupters."
	, "source": "The Quran 28:77 (Surah al-Qasas)"
}, {
	"day": 23.0
	, "arabic": "وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوا الْحَقَّ وَأَنتُمْ تَعْلَمُونَ"
	, "english": "And do not mix the truth with falsehood or conceal the truth while you know [it]."
	, "source": "The Quran 02:42 (Surah al-Baqarah)"
}, {
	"day": 24.0
	, "arabic": "وَإِن تُطِعْ أَكْثَرَ مَن فِي الْأَرْضِ يُضِلُّوكَ عَن سَبِيلِ اللَّـهِ ۚ إِن يَتَّبِعُونَ إِلَّا الظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ"
	, "english": "And if you obey most of those upon the earth, they will mislead you from the way of Allah. They follow not except assumption, and they are not but falsifying."
	, "source": "The Quran 06:116 (Surah al-An’am)"
}, {
	"day": 25.0
	, "arabic": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ ﴿٧﴾ وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ"
	, "english": "So whoever does an atom's weight of good will see it, (7) And whoever does an atom's weight of evil will see it."
	, "source": "The Quran 99:07-08 (Surah az-Zalzalah)"
}, {
	"day": 26.0
	, "arabic": "لِّلَّـهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِن تُبْدُوا مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّـهُ ۖ فَيَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ ۗ وَاللَّـهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ"
	, "english": "To Allah belongs whatever is in the heavens and whatever is in the earth. Whether you show what is within yourselves or conceal it, Allah will bring you to account for it. Then He will forgive whom He wills and punish whom He wills, and Allah is over all things competent."
	, "source": "The Quran 02:284 (Surah al-Baqarah)"
}, {
	"day": 27.0
	, "arabic": "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّـهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ"
	, "english": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], \"We make no distinction between any of His messengers.\" And they say, \"We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.\""
	, "source": "The Quran 02:285 (Surah al-Baqarah)"
}, {
	"day": 28.0
	, "arabic": "لَا يُكَلِّفُ اللَّـهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"
	, "english": "Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. \"Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.\""
	, "source": "The Quran 02:286 (Surah al-Baqarah)"
}, {
	"day": 29.0
	, "arabic": "لَوْ أَنزَلْنَا هَـٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللَّـهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ"
	, "english": "If We had sent down this Qur'an upon a mountain, you would have seen it humbled and coming apart from fear of Allah. And these examples We present to the people that perhaps they will give thought."
	, "source": "The Quran 59:21 (Surah Al-Hashr)"
}, {
	"day": 30.0
	, "arabic": "هُوَ اللَّـهُ الَّذِي لَا إِلَـٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَـٰنُ الرَّحِيمُ ﴿٢٢﴾ هُوَ اللَّـهُ الَّذِي لَا إِلَـٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّـهِ عَمَّا يُشْرِكُونَ"
	, "english": "He is Allah, other than whom there is no deity, Knower of the unseen and the witnessed. He is the Entirely Merciful, the Especially Merciful. (22) He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him."
	, "source": "The Quran 59:22-23 (Surah Al-Hashr)"
}, {
	"day": 31.0
	, "arabic": "هُوَ اللَّـهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ"
	, "english": "He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise."
	, "source": "The Quran 59:24 (Surah Al-Hashr)"
}]