[{
    "day": 1.0,
    "hadith": "I heared the messenger of Allah say : \"That which is lawful is plain and that which is unlawful is plain and between the two of them are doubtful matters about which not many people know. Thus he who avoids doubtful matters clears himself in regard to his religion and his honor, but he who falls into doubtful matters falls into that which is unlawful, like the shepherd who pastures around a sanctuary, all but grazing therein. Truly every king has a sanctuary, and truly Allah's sanctuary is His prohibitions. Truly in the body there is a morsel of flesh which, if it be whole, all the body is whole and which, if it be diseased, all of it is diseased. Truly it is the heart.\"",
    "source": "An Nawawi Hadith Number 006 : The Authority Of Al-Numan bin Basheer [Narrated by Bukhari and Muslim]"
}, {
    "day": 2.0,
    "hadith": "I heared the messenger of Allah say : \"What I have forbidden to you, avoid; what I have ordered you [to do], do as much of it as you can. It was only their excessive questioning and their disagreeing with their prophets that destroyed those who were before you.\"",
    "source": "An Nawawi Hadith Number 009 : The Authority Of Abu Hurairah [Related by Bukhari and Muslim]"
}, {
    "day": 3.0,
    "hadith": "The messenger of Allah said : \"Allah the Almighty is good and accepts only that which is good. Allah has commanded the faithful to do that which he commanded the messengers, and the Almighty has said: \"O ye messengers ! Eat of the good things and do right\". And Allah the Almighty has said : \"O ye who believe! Eat of the good things wherewith We have provided you\" Then he mentioned [the case of] a man who, having journeyed far, is dishevelled and dusty and who spreads out his hands to the sky [saying] : \"O Lord! O Lord!\" - while his food is unlawful, his drink unlawful, his clothing unlawful, and he is nourished unlawfully, so how can he be answered!\"",
    "source": "An Nawawi Hadith Number 010 : The Authority Of Abu Hurairah [Related by Muslim]"
}, {
    "day": 4.0,
    "hadith": "The prophet said : \"None of you [truely] believes until he wishes for his brother what he wishes for himself.\"",
    "source": "An Nawawi Hadith Number 013 : The Authority Of Anas bin Malik [Related by Bukhari and Muslim]"
}, {
    "day": 5.0,
    "hadith": "The messenger of Allah said : \"Let him who believes in Allah and the Last Day either speak good or keep silent, and let him who believes in Allah and the Last Day be generous to his neighbour, and let him who believes in Allah and the Last Day be generous to his guest.\"",
    "source": "An Nawawi Hadith Number 015 : Narrated By Abu Hurairah [Related by Bukhari and Muslim]"
}, {
    "day": 6.0,
    "hadith": "One day I was behind the prophet and he said to me: \"Young man, I shall teach you some words [of advice] : Be mindful of Allah, and Allah will protect you. Be mindful of Allah, and you will find Him in front of you. If you ask, ask of Allah; if you seek help, seek help of Allah. Know that if the Nation were to gather together to benefit you with anything, it would benefit you only with something that Allah had already prescribed for you, and that if they gather together to harm you with anything, they would harm you only with something Allah had already prescribed for you. The pens have been lifted and the pages have dried.\"",
    "source": "An Nawawi Hadith Number 019 : The Authority Of Abdullah bin Abbas [Narrated by Termithi]"
}, {
    "day": 7.0,
    "hadith": "The messenger of Allah said: \"Purity is half of faith. alhamdu-lillah [Praise be to Allah] fills the scales, and subhana-Allah [How far is Allah from every imperfection] and alhamdu-lillah [Praise be to Allah] fill that which is between heaven and earth. Prayer is light; charity is a proof; patience is illumination; and the Quran is an argument for or against you. Everyone starts his day and is a vendor of his soul, either freeing it or bringing about its ruin.\"",
    "source": "An Nawawi Hadith Number 022 : The Authority Of Abu Malik Al-Harith bin Asim Al- Ashari [Related by Muslim]"
}, {
    "day": 8.0,
    "hadith": "The messenger of Allah said : \"Each person's every joint must perform a charity every day the sun comes up : to act justly between two people is a charity; to help a man with his mount, lifting him onto it or hoistingd up his belongings onto it is a charity: a good word is a charity, every step you take to prayers is a charity and removing a harmful thing from the road is a charity.\"",
    "source": "An Nawawi Hadith Number 025 : The Authority Of Abu Hurairah [Related by Bukhari and Muslim]"
}, {
    "day": 9.0,
    "hadith": "The messenger of Allah gave us a sermon by which our hearts were filled with fear and tears came to our eyes. We said: \"O Messenger of Allah, it is as though this is a farewell sermon, so councel us.\" He said: \"I councel you to fear Allah and to give absolute obedience even if a slave becomes your leader. Verily he among you who lives [long] will see great controversy, so you must keep to my sunnah and to the sunnah of the rightly-guided Khalifahs - cling to them stubbornly. Beware of newly invented matters, for every invented matter is an innovation and every innovation is a going astray, and every going astray is in Hell-fire.\"",
    "source": "An Nawawi Hadith Number 028 : The Authority Of Abu Najih Al-Erbadh bin Sariah [Related by Abu Dawud and Al-Tirmithi]"
}, {
    "day": 10.0,
    "hadith": "I heard the messenger of Allah say: \"Whosoever of you sees an evil action, let him change it with his hand; and if he is not able to do so, then with his tongue; and if he is not able to do so, then with his heart; and that is the weakest of faith.\"",
    "source": "An Nawawi Hadith Number 034 : The Authority Of Abu Saeed Al-Khurdari [Related by Muslim]"
}, {
    "day": 11.0,
    "hadith": "The messenger of Allah said : \"Do not envy one another; do not inflate prices one to another; do not hate one another; do not turn away from one another; and do not undercut one another, but be you, O servants of Allah, brothers. A muslim is the brother of a muslim: he neither oppresses him nor does he fail him, he neither lies to him nor does he hold him in contempt. Piety is right here-and he pointed to his breast three times. It is evil enough for a man to hold his brother muslim in contempt. The whole of a muslim for another muslim is inviolable: his blood, his property, and his honor.\"",
    "source": "An Nawawi Hadith Number 035 : The Authority Of Abu Hurairah [Related by Muslim]"
}, {
    "day": 12.0,
    "hadith": "The Prophet said: \"Whosoever removes a worldly grief from a believer, Allah will remove from him one of the griefs of the Day of Judgment. Whosoever alleviates [the lot of] a needy person, Allah will alleviate [his lot] in this world and the next. Whosoever shields a Muslim, Allah will shield him in this world and the next. Allah will aid a servant [of His] so long as the servant aids his brother. Whosoever follows a path to seek knowledge therein, Allah will make easy for him a path to Paradise. No people gather together in one of the houses of Allah, reciting the Book of Allah and studying it among themselves, without tranquility descending upon them, mercy enveloping them, the angels surrounding them, and Allah making mention of them amongst those who are with Him. Whosoever is slowed down by his actions will not be hastened forward by his lineage.\"",
    "source": "An Nawawi Hadith Number 036 : The Authority Of Abu Hurairah [Related by Muslim]"
}, {
    "day": 13.0,
    "hadith": "On the authority of Ibn Abbas that the messenger of Allah, among the sayings he relates from his Lord is :\"Allah has written down the good deeds and the bad ones.\" Then he explained it [by saying that] :\" He who has intended a good deed and has not done it, Allah writes it down with Himself as a full good deed, but if he has intended it and has done it, Allah writes it down with Himself as from ten good deeds to seven hundred times, or many times over. But if he has intended a bad deed and has not done it, Allah writes it down with Himself as a full good deed, but if he has intended it and has done it, Allah writes it down as one bad deed.\"",
    "source": "An Nawawi Hadith Number 037 : The Authority Of Ibn Abbas [Related by Bukhari and Muslim]"
}, {
    "day": 14.0,
    "hadith": "The messenger of Allah said: \"Allah the Almighty has said: 'Who soever shows enmity to a friend of Mine, I shall be at war with him. My servant does not draw near to Me with anything more loved by Me than the religious duties I have imposed upon him, and My servant continues to draw near to Me with supererogatory works so that I shall love him. When I love him I am his hearing with which he hears, his seeing with which he sees, his hand with which he strikes, and his foot with which he walks. Were he to ask [something] of Me, I would surely give it to him and were he to ask Me for refuge, I would surely grant him it.\"",
    "source": "An Nawawi Hadith Number 038 : The Authority Of Abu Hurairah [Related by Bukhari]"
}, {
    "day": 15.0,
    "hadith": "The messenger of Allah took me by the shoulder and said : \"Be in the world as though you were a stranger or a wayfarer.\" The son of Omar used to say: \"At evening do not expect [to live till] morning, and at morning do not expect [to live till] evening. Take from your health for your illness and from your life for your death.\"",
    "source": "An Nawawi Hadith Number 040 : The Authority Of Abdullah bin Omar [Related by Bukhari]"
}, {
    "day": 16.0,
    "hadith": "I heard the messenger of Allah say : Allah the Almighty has said : \"O son of Adam, so long as you call upon Me and ask of Me, I shall forgive you for what you have done, and I shall not mind. O son of Adam, were your sins to reach the clouds of the sky and were you then to ask forgiveness of Me, I would forgive you. O son of Adam, were you to come to Me with sins nearly as great as the earth and were you then to face Me, ascribing no partner to Me, I would bring you forgiveness nearly as great as its.\"",
    "source": "An Nawawi Hadith Number 042 : The Authority Of Anas [Related by Al-Tirmithi, who said that it was a good and sound Hadith.]"
}, {
    "day": 17.0,
    "hadith": "Narated By Abu Huraira : Allah's Apostle said, \"Fasting is a shield (or a screen or a shelter). So, the person observing fasting should avoid sexual relation with his wife and should not behave foolishly and impudently, and if somebody fights with him or abuses him, he should tell him twice, 'I am fasting.\" The Prophet added, \"By Him in Whose Hands my soul is, the smell coming out from the mouth of a fasting person is better in the sight of Allah than the smell of musk. (Allah says about the fasting person), 'He has left his food, drink and desires for My sake. The fast is for Me. So I will reward (the fasting person) for it and the reward of good deeds is multiplied ten times.\"",
    "source": "Sahih Bukhari Volume 003, Book 031, Hadith Number 118."
}, {
    "day": 18.0,
    "hadith": "Narated By Sahl : The Prophet said, \"There is a gate in Paradise called Ar-Raiyan, and those who observe fasts will enter through it on the Day of Resurrection and none except them will enter through it. It will be said, 'Where are those who used to observe fasts?' They will get up, and none except them will enter through it. After their entry the gate will be closed and nobody will enter through it.\"",
    "source": "Sahih Bukhari Volume 003, Book 031, Hadith Number 120."
}, {
    "day": 19.0,
    "hadith": "Narated By Abu Huraira : Allah's Apostle said, \"Whoever gives two kinds (of things or property) in charity for Allah's Cause, will be called from the gates of Paradise and will be addressed, 'O slaves of Allah! Here is prosperity.' So, whoever was amongst the people who used to offer their prayers, will be called from the gate of the prayer; and whoever was amongst the people who used to participate in Jihad, will be called from the gate of Jihad; and whoever was amongst those who used to observe fasts, will be called from the gate of Ar-Raiyan; whoever was amongst those who used to give in charity, will be called from the gate of charity.\" Abu Bakr said, \"Let my parents be sacrificed for you, O Allah's Apostle! No distress or need will befall him who will be called from those gates. Will there be any one who will be called from all these gates?\" The Prophet replied, \"Yes, and I hope you will be one of them.\"",
    "source": "Sahih Bukhari Volume 003, Book 031, Hadith Number 121."
}, {
    "day": 20.0,
    "hadith": "Narated By Abu Huraira : Allah's Apostle said, \"When the month of Ramadan starts, the gates of the heaven are opened and the gates of Hell are closed and the devils are chained.\"",
    "source": "Sahih Bukhari Volume 003, Book 031, Hadith Number 123."
}]