[{
        "day": 1.0
        , "hadith": "Narrated By 'Umar bin Al-Khattab: I heard Allah's Apostle صلى الله عليه وآله وسلم‎ saying, \"The reward of deeds depends upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.\""
        , "source": "Sahih Bukhari Volume 001, Book 001, Hadith Number 001."
}, {
        "day": 2.0
        , "hadith": "Narated By Abu Huraira : The Prophet said, \"Faith (Belief) consists of more than sixty branches (i.e. parts). And Haya (This term \"Haya\" covers a large number of concepts which are to be taken together; amongst them are self respect, modesty, bashfulness, and scruple, etc.) is a part of faith.\""
        , "source": "Sahih Bukhari Volume 001, Book 002, Hadith Number 008."
}, {
        "day": 3.0
        , "hadith": "Narated By Abu Huraira : While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Alllah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who enquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\""
        , "source": "Sahih Bukhari Volume 001, Book 003, Hadith Number 056."
}, {
        "day": 4.0
        , "hadith": "Narated By Abu Huraira : Allah's Apostle said, \"Satan puts three knots at the back of the head of any of you if he is asleep. On every knot he reads and exhales the following words, 'The night is long, so stay asleep.' When one wakes up and remembers Allah, one knot is undone; and when one performs ablution, the second knot is undone, and when one prays the third knot is undone and one gets up energetic with a good heart in the morning; otherwise one gets up lazy and with a mischievous heart.\""
        , "source": "Sahih Bukhari Volume 002, Book 021, Hadith Number 243."
}, {
        "day": 5.0
        , "hadith": "Narated By Abu Huraira : Allah's Apostle (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the nearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, so that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?\""
        , "source": "Sahih Bukhari Volume 002, Book 021, Hadith Number 246."
}, {
        "day": 6.0
        , "hadith": "Narated By Al-Aswad : I asked 'Aisha \"How is the night prayer of the Prophet?\" She replied, \"He used to sleep early at night, and get up in its last part to pray, and then return to his bed. When the Muadh-dhin pronounced the Adhan, he would get up. If he was in need of a bath he would take it; otherwise he would perform ablution and then go out (for the prayer).\""
        , "source": "Sahih Bukhari Volume 002, Book 021, Hadith Number 247."
}
    , {
        "day": 7.0
        , "hadith": "Narated By Sahl : The Prophet said, \"There is a gate in Paradise called Ar-Raiyan, and those who observe fasts will enter through it on the Day of Resurrection and none except them will enter through it. It will be said, 'Where are those who used to observe fasts?' They will get up, and none except them will enter through it. After their entry the gate will be closed and nobody will enter through it.\""
        , "source": "Sahih Bukhari Volume 003, Book 031, Hadith Number 120."
}, {
        "day": 8.0
        , "hadith": "Narated By Abu Huraira : Allah's Apostle said, \"Whoever gives two kinds (of things or property) in charity for Allah's Cause, will be called from the gates of Paradise and will be addressed, 'O slaves of Allah! Here is prosperity.' So, whoever was amongst the people who used to offer their prayers, will be called from the gate of the prayer; and whoever was amongst the people who used to participate in Jihad, will be called from the gate of Jihad; and whoever was amongst those who used to observe fasts, will be called from the gate of Ar-Raiyan; whoever was amongst those who used to give in charity, will be called from the gate of charity.\" Abu Bakr said, \"Let my parents be sacrificed for you, O Allah's Apostle! No distress or need will befall him who will be called from those gates. Will there be any one who will be called from all these gates?\" The Prophet replied, \"Yes, and I hope you will be one of them.\""
        , "source": "Sahih Bukhari Volume 003, Book 031, Hadith Number 121."
}, {
        "day": 9.0
        , "hadith": "Narated By Abu Huraira : Allah's Apostle said, \"Allah said, 'All the deeds of Adam's sons (people) are for them, except fasting which is for Me, and I will give the reward for it.' Fasting is a shield or protection from the fire and from committing sins. If one of you is fasting, he should avoid sexual relation with his wife and quarreling, and if somebody should fight or quarrel with him, he should say, 'I am fasting.' By Him in Whose Hands my soul is' The unpleasant smell coming out from the mouth of a fasting person is better in the sight of Allah than the smell of musk. There are two pleasures for the fasting person, one at the time of breaking his fast, and the other at the time when he will meet his Lord; then he will be pleased because of his fasting.\""
        , "source": "Sahih Bukhari Volume 003, Book 031, Hadith Number 128."
}, {
        "day": 10.0
        , "hadith": "Narated By Abu Huraira : While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Alllah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who enquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\""
        , "source": "Sahih Bukhari Volume 001, Book 003, Hadith Number 056."
}, {
        "day": 11.0
        , "hadith": "Narated By Abu Huraira : Allah's Apostle (p.b.u.h) said, \"Any person who takes a bath on Friday like the bath of Janaba and then goes for the prayer (in the first hour i.e. early), it is as if he had sacrificed a camel (in Allah's cause); and whoever goes in the second hour it is as if he had sacrificed a cow; and whoever goes in the third hour, then it is as if he had sacrificed a horned ram; and if one goes in the fourth hour, then it is as if he had sacrificed a hen; and whoever goes in the fifth hour then it is as if he had offered an egg. When the Imam comes out (i.e. starts delivering the Khutba), the angels present themselves to listen to the Khutba.\""
        , "source": "Sahih Bukhari Volume 002, Book 013, Hadith Number 006."
}, {
        "day": 12.0
        , "hadith": "Narrated By Abu Said Al-Khudri : Allah's Apostle said, \"Noah will be called on the Day of Resurrection and he will say, 'Labbaik and Sa'daik, O my Lord!' Allah will say, 'Did you convey the Message?' Noah will say, 'Yes.' His nation will then be asked, 'Did he convey the Message to you?' They will say, 'No Warner came to us.' Then Allah will say (to Noah), 'Who will bear witness in your favor?' He will say, 'Muhammad and his followers. So they (i.e. Muslims) will testify that he conveyed the Message. And the Apostle (Muhammad) will be a witness over yourselves, and that is what is meant by the Statement of Allah \"Thus We have made of you a just and the best nation that you may be witnesses over mankind and the Apostle (Muhammad) will be a witness over yourselves.\" (2.143)\""
        , "source": "Sahih Bukhari Volume 006, Book 060, Hadith Number 014."
}, {
        "day": 13.0
        , "hadith": "Narrated By Ibn Abbas : The Prophet said, \"Allah said, 'The son of Adam tells a lie against me though he has no right to do so, and he abuses Me though he has no right to do so. As for his telling a lie against Me, it is that he claims that I cannot recreate him as I created him before; and as for his abusing Me, it is his statement that I have offspring. No! Glorified be Me! I am far from taking a wife or offspring.'\""
        , "source": "Sahih Bukhari Volume 006, Book 060, Hadith Number 009. "
}, {
        "day": 14.0
        , "hadith": "From the Messenger of Allah (peace be upon him), among the sayings he related from his Lord (glorified and exalted be He) is that He said : \"Allah has written down the good deeds and the bad ones. Then He explained it [by saying that] he who has intended a good deed and has not done it, Allah writes it down with Himself as a full good deed, but if he has intended it and has done it, Allah writes it down with Himself as from ten good deeds to seven hundred times, or many times over. But if he has intended a bad deed and has not done it, Allah writes it down with Himself as a full good deed, but if he has intended it and has done it, Allah writes it down as one bad deed.\""
        , "source": "Hadith Qudsi Number 016 : The Authority Of Son of Abbas"
}, {
        "day": 15.0
        , "hadith": "The Messenger of Allah (peace be upon him) said : \"Allah (mighty and sublime be He) will say on the Day of Resurrection : O son of Adam, I fell ill and you visited Me not. He will say: O Lord, and how should I visit You when You are the Lord of the worlds? He will say: Did you not know that My servant So-and-so had fallen ill and you visited him not? Did you not know that had you visited him you would have found Me with him? O son of Adam, I asked you for food and you fed Me not. He will say: O Lord, and how should I feed You when You are the Lord of the worlds? He will say: Did you not know that My servant So-and-so asked you for food and you fed him not? Did you not know that had you fed him you would surely have found that (the reward for doing so) with Me? O son of Adam, I asked you to give Me to drink and you gave Me not to drink. He will say: O Lord, how should I give You to drink when You are the Lord of the worlds? He will say: My servant So-and-so asked you to give him to drink and you gave him not to drink. Had you given him to drink you would have surely found that with Me.\""
        , "source": "Hadith Qudsi Number 018 : The Authority Of Abu Hurayrah"
}, {
        "day": 16.0
        , "hadith": "The Messenger of Allah (peace be upon him) said : \"If Allah has loved a servant [of His] He calls Gabriel (on whom be peace) and says: I love So-and-so, therefore love him. He (the Prophet peace be upon him) said: So Gabriel loves him. Then he (Gabriel) calls out in heaven, saying: Allah loves So-and-so, therefore love him. And the inhabitants of heaven love him. He (the Prophet peace be upon him) said: Then acceptance is established for him on earth. And if Allah has abhorred a servant [of His], He calls Gabriel and says: I abhor So-and-so, therefore abhor him. So Gabriel abhors him. Then Gabriel calls out to the inhabitants of heaven: Allah abhors So-and-so, therefore abhor him. He (the Prophet peace be upon him) said: So they abhor him, and abhorrence is established for him on earth.\""
        , "source": "Hadith Qudsi Number 024 : The Authority Of Abu Hurayrah"
}, {
        "day": 17.0
        , "hadith": "The Messenger of Allah (peace be upon him) said : \"Allah (mighty and sublime be He) said : Whosoever shows enmity to someone devoted to Me, I shall be at war with him. My servant draws not near to Me with anything more loved by Me than the religious duties I have enjoined upon him, and My servant continues to draw near to Me with supererogatory works so that I shall love him. When I love him I am his hearing with which he hears, his seeing with which he sees, his hand with which he strikes and his foot with which he walks. Were he to ask [something] of Me, I would surely give it to him, and were he to ask Me for refuge, I would surely grant him it. I do not hesitate about anything as much as I hesitate about [seizing] the soul of My faithful servant: he hates death and I hate hurting him.\""
        , "source": "Hadith Qudsi Number 025 : The Authority Of Abu Hurayrah"
}, {
        "day": 18.0
        , "hadith": "The Messenger of Allah (peace be upon him) said : \"A man sinned greatly against himself, and when death came to him he charged his sons, saying: When I have died, burn me, then crush me and scatter [my ashes] into the sea, for, by Allah, if my Lord takes possession of me, He will punish me in a manner in which He has punished no one [else]. So they did that to him. Then He said to the earth: Produce what you have taken-and there he was! And He said to him: What induced you to do what you did? He said: Being afraid of You, O my Lord (or he said: Being frightened of You) and because of that He forgave him.\""
        , "source": "Hadith Qudsi Number 032 : The Authority Of Abu Hurayrah"
}, {
        "day": 19.0
        , "hadith": "The Prophet (peace be upon him), from among the things he reports from his Lord (mighty and sublime be He), is that he said : \"A servant [of Allah's] committed a sin and said: O Allah, forgive me my sin. And He (glorified and exalted be He) said: My servant has committed a sin and has known that he has a Lord who forgives sins and punishes for them. Then he sinned again and said: O Lord, forgive me my sin. And He (glorified and exalted be He) said: My servant has committed a sin and has known that he has a Lord who forgives sins and punishes for them. Then he sinned again and said: O Lord, forgive me my sin. And He (glorified and exalted be He) said: My servant has committed a sin and has known that he has a Lord who forgives sins and punishes for sins. Do what you wish, for I have forgiven you.\""
        , "source": "Hadith Qudsi Number 033 : The Authority Of Abu Hurayrah"
}, {
        "day": 20.0
        , "hadith": "I heard the Messenger of Allah (peace be upon him) say : \"Allah the Almighty said : O son of Adam, so long as you call upon Me and ask of Me, I shall forgive you for what you have done, and I shall not mind. O son of Adam, were your sins to reach the clouds of the sky and were you then to ask forgiveness of Me, I would forgive you. O son of Adam, were you to come to Me with sins nearly as great as the earth and were you then to face Me, ascribing no partner to Me, I would bring you forgiveness nearly as great at it.\""
        , "source": "Hadith Qudsi Number 034 : The Authority Of Anas"
}, {
        "day": 21.0
        , "hadith": "The Messenger of Allah (peace be upon him) said : \"Our Lord (glorified and exalted be He) descends each night to the earth's sky when there remains the final third of the night, and He says: Who is saying a prayer to Me that I may answer it? Who is asking something of Me that I may give it him? Who is asking forgiveness of Me that I may forgive him?\""
        , "source": "Hadith Qudsi Number 035 : The Authority Of Abu Hurayrah"
}, {
        "day": 22.0
        , "hadith": "The Messenger of Allah (peace be upon him) said : \"Allah will say to the inhabitant of Paradise: O inhabitants of Paradise! They will say: O our Lord, we present ourselves and are at Your pleasure, and goodness rests in Your hands. Then He will say: Are you contented? And they will say: And how should we not be contented, O Lord, when You have given to us that which You have given to no one else of Your creation? Then He will say: Would not like Me to give you something better than that? And they will say: O Lord and what thing is better than that? And He will say: I shall cause My favour to descend upon you and thereafter shall never be displeased with you.\""
        , "source": "Hadith Qudsi Number 040 : The Authority Of Abu Sa'id al-Khudri"
}, {
        "day": 23.0
        , "hadith": "From the Prophet (peace be upon him), who said : \"Allah (mighty and sublime be He) says : The first of his actions for which a servant of Allah will be held accountable on the Day of Resurrection will be his prayers. If they are in order, then he will have prospered and succeeded: and if they are wanting, then he will have failed and lost. If there is something defective in his obligatory prayers, the Lord (glorified and exalted be He) will say: See if My servant has any supererogatory prayers with which may be completed that which was defective in his obligatory prayers. Then the rest of his actions will be judged in like fashion.\""
        , "source": "Hadith Qudsi Number 009 : The Authority Of Abu Harayrah"
}, {
        "day": 24.0
        , "hadith": "From the Prophet (peace be upon him), who said : \"Allah (mighty and sublime be He) says : Fasting is Mine and it I who give reward for it. [A man] gives up his sexual passion, his food and his drink for my sake. Fasting is like a shield, and he who fasts has two joys: a joy whin he breaks his fast and a joy when he meets his Lord. The change in the breath of the mouth of him who fasts is better in Allah's estimation than the smell of musk.\""
        , "source": "Hadith Qudsi Number 010 : The Authority Of Abu Harayrah"
}, {
        "day": 25.0
        , "hadith": "Narated By Anas bin Malik : Allah's Apostle said, \"Allah is more pleased with the repentance of His slave than anyone of you is pleased with finding his camel which he had lost in the desert.\""
        , "source": "Sahih Bukhari Volume 008, Book 075, Hadith Number 321."
}, {
        "day": 26.0
        , "hadith": "Narated By 'Abdullah bin 'Amr : The Prophet said, \"A Muslim is the one who avoids harming Muslims with his tongue and hands. And a Muhajir (emigrant) is the one who gives up (abandons) all what Allah has forbidden.\""
        , "source": "Sahih Bukhari Volume 001, Book 002, Hadith Number 009."
}, {
        "day": 27.0
        , "hadith": "Narated By Abu Huraira : Allah's Apostle said, \"(A believer) who accompanies the funeral procession of a Muslim out of sincere faith and hoping to attain Allah's reward and remains with it till the funeral prayer is offered and the burial ceremonies are over, he will return with a reward of two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who offers the funeral prayer only and returns before the burial, will return with the reward of one Qirat only.\""
        , "source": "Sahih Bukhari Volume 001, Book 002, Hadith Number 045."
}, {
        "day": 28.0
        , "hadith": "Narated By An-Nu'man bin Bashir : I heard Allah's Apostle saying, 'Both legal and illegal things are evident but in between them there are doubtful (suspicious) things and most of the people have no knowledge about them. So whoever saves himself from these suspicious things saves his religion and his honor. And whoever indulges in these suspicious things is like a shepherd who grazes (his animals) near the Hima (private pasture) of someone else and at any moment he is liable to get in it. (O people!) Beware! Every king has a Hima and the Hima of Allah on the earth is His illegal (forbidden) things. Beware! There is a piece of flesh in the body if it becomes good (reformed) the whole body becomes good but if it gets spoilt the whole body gets spoilt and that is the heart.\""
        , "source": "Sahih Bukhari Volume 001, Book 002, Hadith Number 049."
}, {
        "day": 29.0
        , "hadith": "Narated By 'Umar bin Al-Khattab : Allah's Apostle said, \"The reward of deeds depends upon the intention and every person will get the reward according to what he has intended. So whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle. And whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.\""
        , "source": "Sahih Bukhari Volume 001, Book 002, Hadith Number 051."
}, {
        "day": 30.0
        , "hadith": "Narated By Abu Musa : The Prophet said, \"The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water and Allah benefited the people with it and they utilized it for drinking, making their animals drink from it and for irrigation of the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which Allah has revealed through me (the Prophets and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah's guidance revealed through me (He is like that barren land.)\""
        , "source": "Sahih Bukhari Volume 001, Book 003, Hadith Number 079."
}, {
        "day": 31.0
        , "hadith": "The messenger of Allah said : \"Let him who believes in Allah and the Last Day either speak good or keep silent, and let him who believes in Allah and the Last Day be generous to his neighbour, and let him who believes in Allah and the Last Day be generous to his guest.\""
        , "source": "An Nawawi Hadith Number 015 : Narrated By Abu Hurairah (Related by Bukhari and Muslim.)"
}]