[{
    "day": 26.0,
    "hadith": "Narrated By Abu Huraira : The Prophet said, \"Avoid the seven great destructive sins.\" They (the people!) asked, \"O Allah's Apostle! What are they?\" He said, \"To join partners in worship with Allah; to practice sorcery; to kill the life which Allah has forbidden except for a just cause (according to Islamic law); to eat up usury (Riba), to eat up the property of an orphan; to give one's back to the enemy and freeing from the battle-field at the time of fighting and to accuse chaste women who never even think of anything touching chastity and are good believers.\"",
    "source": "Sahih Bukhari Volume 008, Book 082, Hadith Number 840."
}, {
    "day": 27.0,
    "hadith": "Narated By Anas bin Malik : Allah's Apostle (p.b.u.h) said, \"Any Muslim whose three children died before the age of puberty will be granted Paradise by Allah because of His mercy to them.\"",
    "source": "Sahih Bukhari Volume 002, Book 023, Hadith Number 463."
}, {
    "day": 28.0,
    "hadith": "Narated By 'Abdullah bin Amr: Allah's Apostle said. \"It is one of the greatest sins that a man should curse his parents.\" It was asked (by the people), \"O Allah's Apostle! How does a man curse his parents?\" The Prophet said, \"The man abuses the father of another man and the latter abuses the father of the former and abuses his mother.\"",
    "source": "Sahih Bukhari Volume 008, Book 073, Hadith Number 004."
}, {
    "day": 29.0,
    "hadith": "Abdullah reported Allah's Messenger (may peace be upon him) as saying: \"Truth leads one to Paradise and virtue leads one to Paradise and the person tells the truth until he is recorded as truthful, and lie leads to obscenity and obscenity leads to Hell, and the person tells a lie until he is recorded as a liar.\"",
    "source": "Sahih Muslim Book 032, Hadith Number 6307."
}, {
    "day": 30.0,
    "hadith": "Narrated By Sahl bin Sa'd : The Prophet said, \"Whoever guarantees me (the chastity of) what is between his legs (i.e. his private parts), and what is between his jaws (i.e., his tongue), I guarantee him Paradise.\"",
    "source": "Sahih Bukhari Volume 008, Book 082, Hadith Number 799."
}]



