[{
    "day": 1.0,
    "hadith": "I heared the messenger of Allah say : \"That which is lawful is plain and that which is unlawful is plain and between the two of them are doubtful matters about which not many people know. Thus he who avoids doubtful matters clears himself in regard to his religion and his honor, but he who falls into doubtful matters falls into that which is unlawful, like the shepherd who pastures around a sanctuary, all but grazing therein. Truly every king has a sanctuary, and truly Allah's sanctuary is His prohibitions. Truly in the body there is a morsel of flesh which, if it be whole, all the body is whole and which, if it be diseased, all of it is diseased. Truly it is the heart.\"",
    "source": "An Nawawi Hadith Number 006 : The Authority Of Al-Numan bin Basheer [Narrated by Bukhari and Muslim]"
}, {
    "day": 2.0,
    "hadith": "I heared the messenger of Allah say : \"What I have forbidden to you, avoid; what I have ordered you [to do], do as much of it as you can. It was only their excessive questioning and their disagreeing with their prophets that destroyed those who were before you.\"",
    "source": "An Nawawi Hadith Number 009 : The Authority Of Abu Hurairah [Related by Bukhari and Muslim]"
}, {
    "day": 3.0,
    "hadith": "The messenger of Allah said : \"Allah the Almighty is good and accepts only that which is good. Allah has commanded the faithful to do that which he commanded the messengers, and the Almighty has said: \"O ye messengers ! Eat of the good things and do right\". And Allah the Almighty has said : \"O ye who believe! Eat of the good things wherewith We have provided you\" Then he mentioned [the case of] a man who, having journeyed far, is dishevelled and dusty and who spreads out his hands to the sky [saying] : \"O Lord! O Lord!\" - while his food is unlawful, his drink unlawful, his clothing unlawful, and he is nourished unlawfully, so how can he be answered!\"",
    "source": "An Nawawi Hadith Number 010 : The Authority Of Abu Hurairah [Related by Muslim]"
}, {
    "day": 4.0,
    "hadith": "The prophet said : \"None of you [truely] believes until he wishes for his brother what he wishes for himself.\"",
    "source": "An Nawawi Hadith Number 013 : The Authority Of Anas bin Malik [Related by Bukhari and Muslim]"
}, {
    "day": 5.0,
    "hadith": "The messenger of Allah said : \"Let him who believes in Allah and the Last Day either speak good or keep silent, and let him who believes in Allah and the Last Day be generous to his neighbour, and let him who believes in Allah and the Last Day be generous to his guest.\"",
    "source": "An Nawawi Hadith Number 015 : Narrated By Abu Hurairah [Related by Bukhari and Muslim]"
}, {
    "day": 6.0,
    "hadith": "One day I was behind the prophet and he said to me: \"Young man, I shall teach you some words [of advice] : Be mindful of Allah, and Allah will protect you. Be mindful of Allah, and you will find Him in front of you. If you ask, ask of Allah; if you seek help, seek help of Allah. Know that if the Nation were to gather together to benefit you with anything, it would benefit you only with something that Allah had already prescribed for you, and that if they gather together to harm you with anything, they would harm you only with something Allah had already prescribed for you. The pens have been lifted and the pages have dried.\"",
    "source": "An Nawawi Hadith Number 019 : The Authority Of Abdullah bin Abbas [Narrated by Termithi]"
}, {
    "day": 7.0,
    "hadith": "The messenger of Allah said: \"Purity is half of faith. alhamdu-lillah [Praise be to Allah] fills the scales, and subhana-Allah [How far is Allah from every imperfection] and alhamdu-lillah [Praise be to Allah] fill that which is between heaven and earth. Prayer is light; charity is a proof; patience is illumination; and the Quran is an argument for or against you. Everyone starts his day and is a vendor of his soul, either freeing it or bringing about its ruin.\"",
    "source": "An Nawawi Hadith Number 022 : The Authority Of Abu Malik Al-Harith bin Asim Al- Ashari [Related by Muslim]"
}, {
    "day": 8.0,
    "hadith": "The messenger of Allah said : \"Each person's every joint must perform a charity every day the sun comes up : to act justly between two people is a charity; to help a man with his mount, lifting him onto it or hoistingd up his belongings onto it is a charity: a good word is a charity, every step you take to prayers is a charity and removing a harmful thing from the road is a charity.\"",
    "source": "An Nawawi Hadith Number 025 : The Authority Of Abu Hurairah [Related by Bukhari and Muslim]"
}, {
    "day": 9.0,
    "hadith": "The messenger of Allah gave us a sermon by which our hearts were filled with fear and tears came to our eyes. We said: \"O Messenger of Allah, it is as though this is a farewell sermon, so councel us.\" He said: \"I councel you to fear Allah and to give absolute obedience even if a slave becomes your leader. Verily he among you who lives [long] will see great controversy, so you must keep to my sunnah and to the sunnah of the rightly-guided Khalifahs - cling to them stubbornly. Beware of newly invented matters, for every invented matter is an innovation and every innovation is a going astray, and every going astray is in Hell-fire.\"",
    "source": "An Nawawi Hadith Number 028 : The Authority Of Abu Najih Al-Erbadh bin Sariah [Related by Abu Dawud and Al-Tirmithi]"
}, {
    "day": 10.0,
    "hadith": "I heard the messenger of Allah say: \"Whosoever of you sees an evil action, let him change it with his hand; and if he is not able to do so, then with his tongue; and if he is not able to do so, then with his heart; and that is the weakest of faith.\"",
    "source": "An Nawawi Hadith Number 034 : The Authority Of Abu Saeed Al-Khurdari [Related by Muslim]"
}]