[{
	"day": 1.0
	, "arabic": "هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ لَمْ يَكُن شَيْئًا مَّذْكُورًا"
	, "english": "Has there not been over man a period of time when he was nothing to be mentioned?"
	, "source": "The Quran 76:01 (Surah al-Insan)"
}, {
	"day": 2.0
	, "arabic": "الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا ۖ وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا"
	, "english": "Wealth and children are but adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for one’s hope."
	, "source": "The Quran 18:46 (Surah al-Kahf)"
}, {
	"day": 3.0
	, "arabic": "وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّـهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ"
	, "english": "And fear the Day when you shall be brought back to Allah. Then every soul shall be paid what it earned, and none shall be dealt with unjustly."
	, "source": "The Quran 02:281 (Surah al-Baqarah)"
}, {
	"day": 4.0
	, "arabic": "وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ ۚ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا"
	, "english": "Truth has come and falsehood has vanished. Indeed! Falsehood is ever bound to vanish."
	, "source": "The Quran 17:81 (Surah al-Isra)"
}, {
	"day": 5.0
	, "arabic": "أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا ۚ وَإِنَّ اللَّـهَ عَلَىٰ نَصْرِهِمْ لَقَدِيرٌ"
	, "english": "The ones who are (forced to) fight are permitted (to defend themselves) for that they are unjustly (attacked); and surely Allah is indeed Ever-Determiner over giving them victory."
	, "source": "The Quran 22:39 (Surah al-Haj)"
}, {
	"day": 6.0
	, "arabic": "وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا لِّتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ"
	, "english": "And of His Signs is that He created for you mates from among yourselves that you may find tranquillity in them; and He placed between you affection and mercy. Indeed, in that are Signs for those who reflect."
	, "source": "The Quran 30:21 (Surah ar-Rum)"
}, {
	"day": 7.0
	, "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّـهَ وَذَرُوا مَا بَقِيَ مِنَ الرِّبَا إِن كُنتُم مُّؤْمِنِينَ "
	, "english": "O ye who believe! Observe your duty to Allah, and give up what remaineth (due to you) from usury, if you are (in truth) believers."
	, "source": "The Quran 02:278 (Surah al-Baqarah)"
}, {
	"day": 8.0
	, "arabic": "لَا يُكَلِّفُ اللَّـهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ"
	, "english": "Allah does not burden a soul beyond its capacity. It gets the consequence of what good it has earned, and it bears the consequence of what evil it has earned. \"Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our Protector, so give us victory over the wrong-doing people.\""
	, "source": "The Quran 02:286 (Surah al-Baqarah)"
}, {
	"day": 9.0
	, "arabic": "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ ۚ وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ"
	, "english": "He merges night into day, and He merges day into night; and He has full Knowledge of the secrets of all hearts."
	, "source": "The Quran 57:06 (Surah al-Hadid)"
}, {
	"day": 10.0
	, "arabic": "هُوَ الَّذِي جَعَلَ الشَّمْسَ ضِيَاءً وَالْقَمَرَ نُورًا وَقَدَّرَهُ مَنَازِلَ لِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ ۚ مَا خَلَقَ اللَّـهُ ذَٰلِكَ إِلَّا بِالْحَقِّ ۚ يُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ "
	, "english": "t is He Who made the sun a shining light and the moon a derived light and determined for it phases — that you may know the number of years and account (of time). Allah has not created this except in truth. He details the signs for those with knowledge."
	, "source": "The Quran 10:05 (Surah Yunus)"
}]