[{
	"day": 1.0
	, "supplication": "Supplication when waking up"
	, "arabic": "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور"
	, "english": "All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection."
	, "source": "Hisnul Muslim Dua No. 1"
}, {
	"day": 2.0
	, "supplication": "Supplication when wearing a garment"
	, "arabic": "الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة"
	, "english": "All Praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself."
	, "source": "Hisnul Muslim Dua No. 2"
}, {
	"day": 3.0
	, "supplication": "Supplication when entering the toilet"
	, "arabic": "بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث)"
	, "english": "(In the name of Allah). O Allah, I take refuge with you from all evil and evil-doers."
	, "source": "Hisnul Muslim Dua No. 6"
}, {
	"day": 4.0
	, "supplication": "Supplication when leaving the toilet"
	, "arabic": "غُفْـرانَك"
	, "english": "I ask You (Allah) for forgiveness."
	, "source": "Hisnul Muslim Dua No. 7"
}, {
	"day": 5.0
	, "supplication": "Supplication when starting ablution (Wudu)"
	, "arabic": "بِسْمِ الله"
	, "english": "In the name of Allah."
	, "source": "Hisnul Muslim Dua No. 8"
}, {
	"day": 6.0
	, "supplication": "Supplication upon completing the ablution (Wudu)"
	, "arabic": "أَشْهَـدُ أَنْ لا إِلَـهَ إِلاّ اللهُ وَحْدَهُ لا شَريـكَ لَـهُ وَأَشْهَدُ أَنَّ مُحَمّـداً عَبْـدُهُ وَرَسـولُـه"
	, "english": "I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger."
	, "source": "Hisnul Muslim Dua No. 9"
}, {
	"day": 7.0
	, "supplication": "Supplication when leaving the home"
	, "arabic": "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله"
	, "english": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah."
	, "source": "Hisnul Muslim Dua No. 10"
}, {
	"day": 8.0
	, "supplication": "Supplication upoon entering the home"
	, "arabic": "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا"
	, "english": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust."
	, "source": "Hisnul Muslim Dua No. 11"
}, {
	"day": 9.0
	, "supplication": "Supplication when going to the mosque"
	, "arabic": "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا"
	, "english": " O Allah, place within my heart light, and upon my tongue light, and within my ears light, and within my eyes light, and place behind me light and in front of me light and above me light and beneath me light. O Allah, bestow upon me light."
	, "source": "Hisnul Muslim Dua No. 12"
}, {
	"day": 10.0
	, "supplication": "Supplication upon entering the mosque"
	, "arabic": "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا"
	, "english": "I take refuge with Allah, The Supreme and with His Noble Face, and His eternal authority from the accursed devil. In the name of Allah, and prayers and peace be upon the Messenger of Allah. O Allah, open the gates of Your mercy for me."
	, "source": "Hisnul Muslim Dua No. 13"
}]